tests/UKHO.ERPFacade.API.FunctionalTests/ERPFacadeGeneratedXmlFiles/ft-20230707-d11fa-1f494-d84f-08b23a8.xml

<?xml version="1.0" encoding="utf-16"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Z_ADDS_MAT_INFO xmlns="urn:sap-com:document:sap:rfc:functions">
      <IM_MATINFO xmlns="">
        <CORRID>ft-20230707-d11fa-1f494-d84f-08b23a8</CORRID>
        <NOOFACTIONS>7</NOOFACTIONS>
        <RECDATE>20230707</RECDATE>
        <RECTIME>103605</RECTIME>
        <ORG>UKHO</ORG>
        <ACTIONITEMS>
          <item>
            <ACTIONNUMBER>1</ACTIONNUMBER>
            <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>MX545010</CHILDCELL>
            <PRODUCTNAME>MX509226</PRODUCTNAME>
            <CANCELLED>
            </CANCELLED>
            <REPLACEDBY>
            </REPLACEDBY>
            <AGENCY>
            </AGENCY>
            <PROVIDER>
            </PROVIDER>
            <ENCSIZE>
            </ENCSIZE>
            <TITLE>
            </TITLE>
            <EDITIONNO>
            </EDITIONNO>
            <UPDATENO>
            </UPDATENO>
            <UNITTYPE>
            </UNITTYPE>
          </item>
          <item>
            <ACTIONNUMBER>2</ACTIONNUMBER>
            <ACTION>CHANGE ENC CELL</ACTION>
            <PRODUCT>ENC CELL</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>MX545010</CHILDCELL>
            <PRODUCTNAME>MX509226</PRODUCTNAME>
            <CANCELLED>
            </CANCELLED>
            <REPLACEDBY>
            </REPLACEDBY>
            <AGENCY>MX</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>medium</ENCSIZE>
            <TITLE>Isla Clarion</TITLE>
            <EDITIONNO>1</EDITIONNO>
            <UPDATENO>0</UPDATENO>
            <UNITTYPE>
            </UNITTYPE>
          </item>
          <item>
            <ACTIONNUMBER>3</ACTIONNUMBER>
            <ACTION>CHANGE AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>
            </CHILDCELL>
            <PRODUCTNAME>MX545010</PRODUCTNAME>
            <CANCELLED>
            </CANCELLED>
            <REPLACEDBY>
            </REPLACEDBY>
            <AGENCY>MX</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>large</ENCSIZE>
            <TITLE>Isla Clarion</TITLE>
            <EDITIONNO>
            </EDITIONNO>
            <UPDATENO>
            </UPDATENO>
            <UNITTYPE>AVCS Units Coastal</UNITTYPE>
          </item>
          <item>
            <ACTIONNUMBER>4</ACTIONNUMBER>
            <ACTION>CHANGE AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>
            </CHILDCELL>
            <PRODUCTNAME>MX509226</PRODUCTNAME>
            <CANCELLED>
            </CANCELLED>
            <REPLACEDBY>
            </REPLACEDBY>
            <AGENCY>MX</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>large</ENCSIZE>
            <TITLE>Playa del Carmen</TITLE>
            <EDITIONNO>
            </EDITIONNO>
            <UPDATENO>
            </UPDATENO>
            <UNITTYPE>AVCS Units Coastal</UNITTYPE>
          </item>
          <item>
            <ACTIONNUMBER>5</ACTIONNUMBER>
            <ACTION>CHANGE AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>
            </CHILDCELL>
            <PRODUCTNAME>AVCSO</PRODUCTNAME>
            <CANCELLED>
            </CANCELLED>
            <REPLACEDBY>
            </REPLACEDBY>
            <AGENCY>MX</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>large</ENCSIZE>
            <TITLE>AVCS Online Folio Some Title</TITLE>
            <EDITIONNO>
            </EDITIONNO>
            <UPDATENO>
            </UPDATENO>
            <UNITTYPE>AVCS Online Folio</UNITTYPE>
          </item>
          <item>
            <ACTIONNUMBER>6</ACTIONNUMBER>
            <ACTION>CHANGE AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>
            </CHILDCELL>
            <PRODUCTNAME>PAYSF</PRODUCTNAME>
            <CANCELLED>
            </CANCELLED>
            <REPLACEDBY>
            </REPLACEDBY>
            <AGENCY>MX</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>large</ENCSIZE>
            <TITLE>World Folio</TITLE>
            <EDITIONNO>
            </EDITIONNO>
            <UPDATENO>
            </UPDATENO>
            <UNITTYPE>AVCS Folio Transit</UNITTYPE>
          </item>
          <item>
            <ACTIONNUMBER>7</ACTIONNUMBER>
            <ACTION>REMOVE ENC CELL FROM AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>MX545010</CHILDCELL>
            <PRODUCTNAME>MX545010</PRODUCTNAME>
            <CANCELLED>
            </CANCELLED>
            <REPLACEDBY>
            </REPLACEDBY>
            <AGENCY>
            </AGENCY>
            <PROVIDER>
            </PROVIDER>
            <ENCSIZE>
            </ENCSIZE>
            <TITLE>
            </TITLE>
            <EDITIONNO>
            </EDITIONNO>
            <UPDATENO>
            </UPDATENO>
            <UNITTYPE>
            </UNITTYPE>
          </item>
        </ACTIONITEMS>
      </IM_MATINFO>
    </Z_ADDS_MAT_INFO>
  </soap:Body>
</soap:Envelope>